namespace NtinasPieShop.Models
{
    public interface IPieRepository
    {
        IEnumerable<Pie> AllPies { get; } //Το IEnumerable<Pie> σημαίνει ότι αυτή η ιδιότητα επιστρέφει μια συλλογή
                                          //από αντικείμενα Pie. Το IEnumerable είναι μια διεπαφή συλλογής που
                                          //υποστηρίζει απλή επανάληψη (iteration) στα στοιχεία.
        IEnumerable<Pie> PiesOfTheWeek { get; }//Το get; δηλώνει ότι είναι μόνο για ανάγνωση.
                                               //Αυτό σημαίνει ότι μπορείς να πάρεις την τιμή
                                               //αυτής της ιδιότητας, αλλά δεν μπορείς να την αλλάξεις απευθείας.

        Pie? GetPieById (int pieId);  // μέθοδος αυτή επιστρέφει ένα αντικείμενο τύπου Pie ή null
                                      // (το ερωτηματικό σημαίνει ότι είναι nullable).
                                      // Αυτό συμβαίνει γιατί μπορεί να μην βρεθεί
                                      // πίτα με το συγκεκριμένο pieId, οπότε σε αυτή την περίπτωση θα επιστρέψει null.

    }
}
